tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# tap 'puma/puma'
# brew 'puma/puma/puma-dev'

#   __                            _
#  / _| ___  _ __ _ __ ___  _   _| | __ _
# | |_ / _ \| '__| '_ ` _ \| | | | |/ _` |
# |  _| (_) | |  | | | | | | |_| | | (_| |
# |_|  \___/|_|  |_| |_| |_|\__,_|_|\__,_|
#
brew "autojump"
brew "asdf"
brew "awscli"
brew "bash"
brew "bash-completion"
# brew "circleci", args: ["--ignore-dependencies"]
brew "coreutils"
brew "ffmpeg"
brew "figlet"
brew "findutils"
# brew "fswatch"
brew "gettext"
brew "gifsicle"
brew "git"
# brew "gitup"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "heroku/brew/heroku"
brew "hub"
brew "jq"
brew "mas"
brew "netcat"
brew "openssl"
brew "p7zip"
# brew "parallel"
# brew "pv"
# brew "rclone"
brew "readline"
brew "rename"
brew "shellcheck"
brew "tmux"
brew "watch"
brew "wget"
brew "xz"

#                _
#   ___ __ _ ___| | __
#  / __/ _` / __| |/ /
# | (_| (_| \__ \   <
#  \___\__,_|___/_|\_\
#
# cask "android-file-transfer"
cask "appcleaner"
cask "atom"
# cask "audiobookbinder"
cask "bartender"
# cask "blackhole"
# cask "brave-browser"
cask "calibre"
cask "daisydisk"
# cask "discord"
cask "divvy"
cask "docker"
cask "dropbox"
# cask "figma"
cask "firefox"
cask "google-chrome"
# cask "google-cloud-sdk"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
# cask "keybase"
# cask "macvim"
cask "openvpn-connect"
cask "skitch"
cask "slack"
cask "spotify"
# cask "steam"
cask "sublime-merge"
cask "sublime-text"
# cask "texmaker"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "vox"
cask "wavebox"
cask "windscribe"
cask "xquartz"

#                        _
#   __ _ _ __  _ __  ___| |_ ___  _ __ ___
#  / _` | '_ \| '_ \/ __| __/ _ \| '__/ _ \
# | (_| | |_) | |_) \__ \ || (_) | | |  __/
#  \__,_| .__/| .__/|___/\__\___/|_|  \___|
#       |_|   |_|

mas "Amphetamine", id: 937984704
mas "CopyClip", id: 595191960
mas "TickTick", id: 966085870
mas "1Password 7", id: 1333542190
