tap "1password/tap"

#   __                            _
#  / _| ___  _ __ _ __ ___  _   _| | __ _
# | |_ / _ \| '__| '_ ` _ \| | | | |/ _` |
# |  _| (_) | |  | | | | | | |_| | | (_| |
# |_|  \___/|_|  |_| |_| |_|\__,_|_|\__,_|
#
brew "asdf"                # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "ast-grep"            # Code searching, linting, rewriting
brew "autojump"            # Shell extension to jump to frequently used directories
brew "awscli"              # Official Amazon AWS command-line interface
brew "bash"                # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion"     # Programmable completion for Bash 3.2
brew "beads"               # Memory upgrade for your coding agent
brew "coreutils"           # GNU File, Shell, and Text utilities
brew "duti"                # Select default apps for documents and URL schemes on macOS
brew "ffmpeg"              # Play, record, convert, and stream select audio and video codecs
brew "figlet"              # Banner-like program prints strings as ASCII art
brew "findutils"           # Collection of GNU find, xargs, and locate
brew "flyctl"              # Command-line tools for fly.io services
brew "fswatch"             # Monitor a directory for changes and run a shell command
brew "fzf"                 # Command-line fuzzy finder written in Go
brew "gettext"             # GNU internationalization (i18n) and localization (l10n) library
brew "gh"                  # GitHub command-line tool
brew "git"                 # Distributed revision control system
brew "git-town"            # High-level command-line interface for Git (`git up` -> `git town sync`)
brew "gnu-sed"             # GNU implementation of the famous stream editor
brew "gnu-tar"             # GNU version of the tar archiving utility
brew "gnupg"               # GNU Privacy Guard (OpenPGP)
brew "jq"                  # Lightweight and flexible command-line JSON processor
brew "just"                # Handy way to save and run project-specific commands
brew "libass"              # Subtitle renderer for the ASS/SSA subtitle format
brew "libyaml"             # YAML Parser
brew "mas"                 # Mac App Store command-line interface
brew "ollama"              # Create, run, and share large language models (LLMs)
brew "openssl@3"           # Cryptography and SSL/TLS Toolkit
brew "pandoc"              # Swiss-army knife of markup format conversion
brew "postgresql@18"       # Object-relational database system
brew "railway"             # Develop and deploy code with zero configuration
brew "rclone"              # Rsync for cloud storage
brew "readline"            # Library for command-line editing
brew "rename"              # Perl-powered file rename script with many helpful built-ins
brew "tmux"                # Terminal multiplexer
brew "tmuxinator"          # Manage complex tmux sessions easily
brew "watch"               # Executes a program periodically, showing output fullscreen
brew "watchman"            # Watch files and take action when they change
brew "wget"                # Internet file retriever
brew "wxwidgets"           # Cross-platform C++ GUI toolkit
brew "xz"                  # General-purpose data compression with high compression ratio

#                _
#   ___ __ _ ___| | __
#  / __/ _` / __| |/ /
# | (_| (_| \__ \   <
#  \___\__,_|___/_|\_\
#
cask "1password"           # Password manager that keeps all passwords secure behind one password
cask "1password-cli"       # Command-line interface for 1Password
cask "antigravity-cli"     # Terminal interface for Antigravity agents
cask "basictex"            # Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "claude"              # Anthropic's official Claude AI desktop app
cask "claude-code"         # Terminal-based AI coding assistant
cask "docker-desktop"      # App to build and share containerised applications and microservices
cask "dropbox"             # Client for the Dropbox cloud storage service
cask "firefox"             # Web browser
cask "google-chrome"       # Web browser
cask "handy"               # Speech to text application
cask "istat-menus"         # ($) | System monitoring app
cask "iterm2"              # Terminal emulator as alternative to Apple's Terminal app
cask "karabiner-elements"  # Keyboard customiser
cask "maccy"               # clipboard history manager | Clipboard manager
cask "macfuse"             # File system integration
cask "moom"                # ($) | Utility to move and zoom windows—on one display
cask "postico"             # ($) | GUI client for PostgreSQL databases
cask "shottr"              # ($) | Screenshot measurement and annotation tool
cask "signal"              # Instant messaging application focusing on security
cask "spotify"             # Music streaming service
cask "sublime-merge"       # ($) | Git client
cask "sublime-text"        # ($) | Text editor for code, markup and prose
cask "thunderbird"         # Customizable email client
cask "utm"                 # gui for qemu | Virtual machines UI using QEMU
cask "veracrypt"           # Disk encryption software focusing on security based on TrueCrypt
cask "visual-studio-code"  # Open-source code editor
cask "wavebox"             # Cookie-segmented browser for better account management

#                        _
#   __ _ _ __  _ __  ___| |_ ___  _ __ ___
#  / _` | '_ \| '_ \/ __| __/ _ \| '__/ _ \
# | (_| | |_) | |_) \__ \ || (_) | | |  __/
#  \__,_| .__/| .__/|___/\__\___/|_|  \___|
#       |_|   |_|
#
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
mas "Windows App", id: 1295203466

