tap "homebrew/cask"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# tap 'nonrational/puma'
# brew 'nonrational/puma/puma-dev'

brew "autojump"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fswatch"
brew "gettext"
brew "gifsicle"
brew "git"
brew "gitup"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "goenv"
brew "heroku/brew/heroku"
brew "hub"
brew "mas"
brew "netcat"
brew "node-build"
brew "nodenv"
brew "openssl"
brew "p7zip"
brew "parallel"
brew "pv"
brew "pyenv"
brew "rbenv"
brew "rbenv-gemset"
brew "rclone"
brew "readline"
brew "rename"
brew "ruby-build"
brew "shellcheck"
brew "tmux"
brew "wget"
brew "xz"

# cask "1password"
cask "android-file-transfer"
cask "appcleaner"
cask "atom"
cask "audiobookbinder"
cask "bartender"
cask "brave-browser"
cask "calibre"
cask "daisydisk"
cask "discord"
cask "divvy"
cask "docker"
# cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "macvim"
cask "skitch"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "texmaker"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "vox"
cask "wavebox"
cask "windscribe"
cask "x-quartz"

mas "Amphetamine", id: 937984704
mas "CopyClip", id: 595191960
mas "TickTick", id: 966085870
# mas "1Password 7", id: 1333542190
