ack
ansible
ant
ant-contrib
autoconf
autoconf213
autojump
automake
aws-elasticbeanstalk
awscli
bash
bash-completion
bisonphp26
boost
casperjs
cloc
cloog018
cmake
coreutils
cowsay
ctags
curl
cvs
dnsmasq
docker
dos2unix
doxygen
ecj
exercism
ffmpeg
figlet
findutils
flac
flock
freetype
freetypephp
gcc48
gcc5
gdbm
geoip
gettext
gflags
ghostscript
gifsicle
gist
git
git-extras
git-flow
glew
glm
gmp
gmp4
gnu-getopt
gnu-sed
gnu-tar
gnupg
gnutls
go
gradle
gradle112
groovy
htop-osx
hub
icu4c
imagemagick
isl011
isl014
jbig2dec
jpeg
jq
keybase
lame
lftp
libevent
libid3tag
libmp3splt
libmpc
libmpc08
libogg
libpng
libsodium
libtasn1
libtiff
libtool
libvo-aacenc
libvorbis
libxml2
libyaml
little-cms2
lz4
mad
makedepend
maven2
maven30
mcrypt
mhash
mogenerator
mongodb
mp3splt
mpfr
mpfr2
mysql
nettle
nginx
nmap
node
openssl
ossp-uuid
p7zip
packer
parallel
passenger
pcre
phantomjs
pidof
pkg-config
play
postgresql
pow
pv
python
qt
readline
recode
rename
rmtrash
rocksdb
scons
sdl2
sdl2_image
siege
sleepwatcher
snappy
sqlite
ssh-copy-id
swig
texi2html
thrift
tor
tree
unnethack
v8
watch
webp
wget
x264
xvid
xz
yara
yasm
zlibphp
